# Используем официальный образ Node.js
FROM node:14-alpine

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем package.json и package-lock.json (или yarn.lock) в рабочую директорию контейнера
COPY package*.json ./

# Устанавливаем зависимости приложения
RUN npm install

# Копируем остальные файлы приложения в рабочую директорию контейнера
COPY . .

# Собираем приложение для production
RUN npm run build

# Экспонируем порт 3000 для доступа к приложению извне контейнера
EXPOSE 3000

# Команда для запуска React-приложения внутри контейнера
CMD ["npm", "start"]
